<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="Historia de las aplicaciones web, sus orígenes, evolución y el impacto actual.">
    <meta name="keywords" content="Historia, Web, Aplicaciones, Evolución">
    <title>Historia de Aplicaciones Web</title>
    <style>
        body {
            font-family: Arial, sans-serif;
            margin: 20px;
        }

        nav a {
            margin-right: 15px;
            text-decoration: none;
            color: #2980B9;
        }

        section {
            margin-bottom: 40px;
        }
    </style>
</head>

<body>
    <nav>
        <a href="index.html">Inicio</a>
        <a href="historia.html">Historia Web</a>
        <a href="cv.html">CV</a>
    </nav>
    <header>
        <h1>Historia de Aplicaciones Web</h1>
        <p>Explora los hitos históricos de la web.</p>
        <h1>Historia de Aplicaciones Web</h1>
        <p>Explora los hitos hist&oacute;ricos de la web.</p>
    </header>
    <section id="origenes">
        <h2>Or&iacute;genes</h2>
        <p>
            La web tuvo sus inicios a finales de los a&ntilde;os 80 como un proyecto de investigaci&oacute;n liderado
            por Tim
            Berners-Lee en el CERN (Organizaci&oacute;n Europea para la Investigaci&oacute;n Nuclear). En ese momento,
            los cient&iacute;ficos
            necesitaban un sistema eficiente para compartir informaci&oacute;n entre distintas instituciones sin
            depender de
            formatos f&iacute;sicos o protocolos incompatibles.
            En 1989, Berners-Lee propuso un sistema basado en hipertexto que permitiera enlazar documentos a
            trav&eacute;s de
            una red. Para ello, desarroll&oacute; los conceptos fundamentales de la web: el protocolo HTTP (Hypertext
            Transfer
            Protocol), el lenguaje HTML (HyperText Markup Language) y el primer navegador web. Un a&ntilde;o
            despu&eacute;s, en 1990,
            cre&oacute; el primer sitio web de la historia en un servidor del CERN, donde explicaba el funcionamiento de
            esta
            nueva tecnolog&iacute;a.
            El prop&oacute;sito original de la web era simplificar el acceso a la informaci&oacute;n cient&iacute;fica y
            mejorar la
            colaboraci&oacute;n entre investigadores. Sin embargo, su potencial pronto se hizo evidente m&aacute;s
            all&aacute; del &aacute;mbito
            acad&eacute;mico. En 1993, con la llegada del navegador Mosaic, la web comenz&oacute; a expandirse
            r&aacute;pidamente, dando paso
            a su adopci&oacute;n global y revolucionando la manera en que la informaci&oacute;n es creada, compartida y
            consumida.
            Lo que comenz&oacute; como un experimento en un laboratorio europeo termin&oacute; convirti&eacute;ndose en
            uno de los avances
            tecnol&oacute;gicos m&aacute;s importantes de la historia, sentando las bases de la sociedad digital
            moderna.
        </p>
        <a href="#evolucion">Siguiente: Evoluci&oacute;n</a>
    </section>
    <section id="evolucion">
        <h2>Evoluci&oacute;n</h2>
        <h3>Web 0.1 - La Web Est&aacute;tica</h3>
        <p>La Web 0.1, tambi&eacute;n conocida como Web Est&aacute;tica, surgi&oacute; en los primeros a&ntilde;os de la
            World Wide Web y se centr&oacute;
            en la distribuci&oacute;n de informaci&oacute;n de manera unidireccional. En esta etapa, los sitios web eran
            esencialmente
            documentos HTML est&aacute;ticos, dise&ntilde;ados &uacute;nicamente para presentar contenido sin ofrecer
            ninguna funcionalidad
            interactiva.</p>

        <h3>Web 0.2 - La Web Din&aacute;mica</h3>
        <p>La Web 0.2 represent&oacute; un avance significativo con respecto a la Web 0.1, al introducir contenido
            din&aacute;mico
            generado en el servidor mediante tecnolog&iacute;as como CGI (Common Gateway Interface), PHP (Hypertext
            Preprocessor) y ASP (Active Server Pages).</p>

        <h3>Web 0.3 - La Web Sem&aacute;ntica</h3>
        <p>La Web 0.3 marc&oacute; un punto de inflexi&oacute;n en la evoluci&oacute;n de Internet, al dar inicio a la
            interacci&oacute;n
            bidireccional entre los usuarios y las plataformas en l&iacute;nea.</p>

        <h3>Web 0.4 - La Web Conectada</h3>
        <p>La Web 0.4 representa un salto hacia una internet m&aacute;s inteligente, donde las m&aacute;quinas pueden
            comprender,
            interpretar y procesar la informaci&oacute;n de manera m&aacute;s avanzada.</p>

        <a href="#impacto">Siguiente: Impacto Actual</a>
    </section>
    <section id="impacto">
        <h2>Impacto Actual</h2>
        <p>La evoluci&oacute;n de la web ha transformado radicalmente la manera en que las personas interact&uacute;an,
            trabajan,
            aprenden y se comunican. Desde sus inicios como un simple repositorio de informaci&oacute;n est&aacute;tica
            hasta convertirse
            en un entorno din&aacute;mico y altamente personalizado, la web ha redefinido pr&aacute;cticamente todos los
            aspectos de la
            vida moderna.</p>
        <p>Las aplicaciones web actuales han permitido una conectividad global sin precedentes, facilitando el acceso
            instant&aacute;neo a informaci&oacute;n, entretenimiento, educaci&oacute;n y servicios en l&iacute;nea.</p>
        <p>El avance hacia la Web 0.4 sigue abriendo posibilidades para experiencias m&aacute;s inteligentes y
            personalizadas. La
            implementaci&oacute;n de inteligencia artificial, el procesamiento de datos en la nube y la
            automatizaci&oacute;n est&aacute;n
            permitiendo que los sistemas web sean capaces de adaptarse a las necesidades de cada usuario en tiempo real.
        </p>
        <p>A medida que la web sigue desarroll&aacute;ndose, surgen nuevos desaf&iacute;os y oportunidades. La
            seguridad, la privacidad
            de los datos y la &eacute;tica digital son aspectos cada vez m&aacute;s relevantes en un mundo donde la
            tecnolog&iacute;a avanza a
            pasos agigantados.</p>
        <a href="#origenes">Volver al Inicio de la Historia</a>
    </section>
</body>

</html>